.doom.d/config.org
*** LSP
#+begin_src emacs-lisp :tangle packages.el
(package! company-tabnine)
(package! tree-sitter)
(package! tree-sitter-langs)
#+end_src
#+begin_src emacs-lisp

(after! lsp-clangd
  (setq lsp-clients-clangd-args
        '("--all-scopes-completion"
          "--background-index"
          "--clang-tidy"
          "--completion-style=bundled"
          "--header-insertion=iwyu"
          "--header-insertion-decorators"
          "--suggest-missing-includes"
          "--pch-storage=memory"
          ;; "--limit-results=10"
          "-j=8"
          "--cross-file-rename"
          "--ranking-model=decision_forest")
        lsp-semantic-tokens-enable t
        ;; lsp-semantic-tokens-warn-on-missing-face t
        lsp-semantic-tokens-apply-modifiers t
        lsp-headerline-breadcrumb-enable t
        lsp-headerline-breadcrumb-enable-diagnostics t
        lsp-auto-guess-root t
        lsp-lens-enable t
        lsp-lens-debounce-interval 0.3
        )
  (set-lsp-priority! 'clangd 2))

(setq rustic-lsp-server 'rust-analyzer)

(after! rustic
  (setq lsp-rust-server 'rust-analyzer))

(after! lsp-rust
  (setq lsp-rust-server 'rust-analyzer))

(use-package! tree-sitter
  :config
  (require 'tree-sitter-langs)
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(after! company
  (setq
   company-idle-delay 0.01
   company-minimum-prefix-length 1
   company-show-numbers t
   company-backends '((company-tabnine :separate company-capf company-yasnippet))
   +lsp-company-backends '(company-tabnine :separate company-capf company-yasnippet)
   ;; +company-backend-alist '((org-mode company-tabnine company-capf)
   ;;                          (text-mode (:separate company-tabnine company-dabbrev company-yasnippet company-ispell))
   ;;                          (prog-mode company-tabnine company-capf company-yasnippet)
   ;;                          (conf-mode company-tabnine company-capf company-dabbrev-code company-yasnippet))
   )
  (add-hook 'evil-normal-state-entry-hook #'company-abort)
  )

;; (use-package corfu
;;   ;; TAB-and-Go customizations
;;   :custom
;;   (corfu-cycle t)             ;; Enable cycling for `corfu-next/previous'
;;   (corfu-auto t)
;;   (corfu-preselect-first nil) ;; Disable candidate preselection

;;   ;; Use TAB for cycling, default is `corfu-complete'.
;;   :bind
;;   (:map corfu-map
;;         ("TAB" . corfu-next)
;;         ([tab] . corfu-next)
;;         ("S-TAB" . corfu-previous)
;;         ([backtab] . corfu-previous))

;;   :init
;;   (corfu-global-mode))

;; (after! company-tng
;; (setq company-require-match nil
;;     company-clang-insert-arguments t
;;     company-semantic-insert-arguments t
;;     company-rtags-insert-arguments t
;;     lsp-enable-snippet t))

(after! company-tabnine
  (setq company-tabnine-max-num-results 3
        company-tabnine-always-trigger t))
#+end_src

#+RESULTS:

*** Faces
#+begin_src emacs-lisp
;; (after! doom-themes
;;   (custom-set-faces!
;;     `(line-number :foreground ,(doom-color 'base4))
;;     ;; `(line-number :foreground "#5b595c")
;;     `(line-number-current-line :foreground "#c1c0c0")
;;     `(hl-line :background "#373538")
;;     `(treemacs-file-face :foreground ,(doom-color 'white))
;;     `(org-block :background ,(doom-color 'bg))
;;     `(org-block-begin-line :background ,(doom-color 'bg))
;;     `(org-block-end-line :background ,(doom-color 'bg))
;;     `(vertical-border :background "#221F22" :foreground "#221F22")
;;     `(eldoc-box-body :background "#423f42")
;;     `(font-lock-doc-face :foreground ,(doom-color 'grey))
;;     `(lsp-face-semhl-parameter :slant italic :foreground ,(doom-color 'orange))
;;     `(highlight-numbers-number :bold nil)
;;     ))
#+end_src
*** Smooth Scroll
#+begin_src emacs-lisp :tangle packages.el
(package! scroll-on-jump)
#+end_src

#+begin_src emacs-lisp
(use-package scroll-on-jump
  :config
  (setq scroll-on-jump-duration 0.2))

(after! evil
  (scroll-on-jump-advice-add evil-undo)
  (scroll-on-jump-advice-add evil-redo)
  (scroll-on-jump-advice-add evil-jump-item)
  (scroll-on-jump-advice-add evil-jump-forward)
  (scroll-on-jump-advice-add evil-jump-backward)
  (scroll-on-jump-advice-add evil-ex-search-next)
  (scroll-on-jump-advice-add evil-ex-search-previous)
  (scroll-on-jump-advice-add evil-forward-paragraph)
  (scroll-on-jump-advice-add evil-backward-paragraph)
  (scroll-on-jump-advice-add evil-goto-mark)
  (scroll-on-jump-advice-add evil-goto-first-line)

  ;; Actions that themselves scroll.
  (scroll-on-jump-with-scroll-advice-add evil-goto-line)
  (scroll-on-jump-advice-add evil-scroll-down)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-up)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-line-to-center)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-line-to-top)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-line-to-bottom))

(after! goto-chg
  (scroll-on-jump-advice-add goto-last-change)
  (scroll-on-jump-advice-add goto-last-change-reverse))
#+end_src
*** Treemacs
#+begin_src emacs-lisp :tangle packages.el
(package! treemacs-all-the-icons)
#+end_src
#+begin_src emacs-lisp
(use-package! doom-themes
  :init
  (setq doom-themes-neotree-file-icons t)
  (setq doom-themes-treemacs-theme nil
        treemacs-window-background-color '("#221F22" . "#423f42"))
  :config
  (require 'treemacs-all-the-icons)
  (treemacs-load-theme "all-the-icons"))

(after! treemacs
    (treemacs-follow-mode 1)
    (treemacs-git-mode 'deferred)
    (treemacs-filewatch-mode 1))
(after! lsp-treemacs
    (lsp-treemacs-sync-mode 1))
#+end_src
*** Vterm
#+begin_src emacs-lisp
(after! vterm
  (add-hook 'vterm-mode-hook
            (lambda () (face-remap-add-relative 'default '(:background "#423f42")))))
(define-key! vterm-mode-map
  "C-w" nil
  "<C-w>" nil
  )
#+end_src
** Evil Mode
*** Evil
#+begin_src emacs-lisp
(use-package! evil
  :init
  (add-hook 'evil-normal-state-entry-hook (lambda () (setq-local display-line-numbers 'relative)))
  (add-hook 'evil-insert-state-entry-hook (lambda () (setq-local display-line-numbers t)))
  (setq
   evil-respect-visual-line-mode     nil
   evil-split-window-below           t
   evil-vsplit-window-right          t
   ;; evil-want-fine-undo t
   evil-collection-setup-minibuffer  t
   evil-ex-substitute-global t
   )
  (define-key evil-normal-state-map (kbd "C-z") 'evil-undo)

  :config
  ;; make _ part of a word
  (add-hook 'c-mode-common-hook (lambda () (modify-syntax-entry ?_ "w"))))
#+end_src

*** Args
#+begin_src emacs-lisp :tangle packages.el
(package! evil-args)
#+end_src

#+begin_src emacs-lisp
(after! evil
  (define-key evil-inner-text-objects-map "," 'evil-inner-arg)
  (define-key evil-outer-text-objects-map "," 'evil-outer-arg))
#+end_src
*** ReplaceWithRegister
#+begin_src emacs-lisp :tangle packages.el
(package! evil-replace-with-register)
#+end_src
#+begin_src emacs-lisp
;; (after! evil-replace-with-register
;;   (setq evil-replace-with-register-key "yr")
;;   (evil-replace-with-register-install))
#+end_src
*** Little Word
#+begin_src emacs-lisp :tangle packages.el
(package! evil-little-word
  :recipe (:host github :repo "tarao/evil-plugins"
           :files ("evil-little-word.el")))
#+end_src
#+begin_src emacs-lisp
(after! evil-little-word
  ;; (define-key evil-motion-state-map (kbd "w") 'evil-forward-little-word-begin)
  ;; (define-key evil-motion-state-map (kbd "b") 'evil-backward-little-word-begin)
  ;; (define-key evil-motion-state-map (kbd "W") 'evil-forward-little-word-end)
  ;; (define-key evil-motion-state-map (kbd "B") 'evil-backward-little-word-end)
  ;; (define-key evil-visual-state-map (kbd "w") 'evil-forward-little-word-begin)
  ;; (define-key evil-visual-state-map (kbd "b") 'evil-backward-little-word-begin)
  (define-key evil-visual-state-map (kbd "i v") 'evil-inner-little-word)
  (define-key evil-outer-text-objects-map (kbd "v") 'evil-a-little-word)
  (define-key evil-inner-text-objects-map (kbd "v") 'evil-inner-little-word))
#+end_src
*** Snipe
#+begin_src emacs-lisp
(after! evil-snipe
  (setq evil-snipe-scope 'buffer
        evil-snipe-spillover-scope 'whole-buffer
        evil-snipe-repeat-scope 'whole-buffer
        evil-snipe-tab-increment t))
#+end_src
