.doom.d/packages.el

(package! company-tabnine)
(package! tree-sitter)
(package! tree-sitter-langs)

(package! scroll-on-jump)

(package! treemacs-all-the-icons)

(package! evil-args)

(package! evil-replace-with-register)

(package! evil-little-word
  :recipe (:host github :repo "tarao/evil-plugins"
           :files ("evil-little-word.el")))
