.doom.d/config.org
*** Ranger
#+begin_src emacs-lisp
(after! ranger
  (setq ranger-override-dired t
        ranger-hide-cursor nil
        ranger-preview-delay 0.2
        ranger-dont-show-binary t
        ranger-max-preview-size 500
        ranger-cleanup-eagerly t
        ))
#+end_src
*** Which-key
#+begin_src emacs-lisp
(after! which-key
  (setq which-key-idle-delay 0.4))
#+end_src
*** Lion
#+begin_src emacs-lisp
(after! evil-lion (evil-lion-mode))
#+end_src
** Org Mode
#+begin_src emacs-lisp :tangle packages.el
(package! org-pretty-table
  :recipe (:host github :repo "Fuco1/org-pretty-table"))

(package! org-fragtog)
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
(package! org-pretty-tags)
#+end_src

#+begin_src emacs-lisp
(after! mixed-pitch
(setq mixed-pitch-variable-pitch-cursor nil
      mixed-pitch-set-height t)

(add-hook! org-mode :append #'mixed-pitch-mode)
)

(add-hook 'org-mode-hook
          (lambda () (add-hook 'after-save-hook #'org-babel-tangle
                               :append :local)))

(use-package! org-pretty-table
  :commands (org-pretty-table-mode global-org-pretty-table-mode))

(use-package! info-colors
  :defer t
  :commands (info-colors-fontify-node))

(add-hook 'Info-selection-hook 'info-colors-fontify-node)
#+end_src
** Pending
#+begin_src emacs-lisp :tangle packages.el
;; (package! centered-window-mode
;;   :recipe (:host github :repo "anler/centered-window-mode"
;;            :files ("centered-window.el")))

;; (package! git-gutter :recipe (:host github :repo "theol0403/git-gutter"))
;; (package! git-gutter :recipe (:local-repo "~/Documents/github/git-gutter" :build (:not compile)))

;; (package! solaire-mode :disable t)

(package! aas :recipe (:host github :repo "ymarco/auto-activating-snippets"))
(package! laas :recipe (:local-repo "lisp/LaTeX-auto-activating-snippets"))

;; (unpin! doom-themes)
;; (package! doom-themes :recipe (:host github :repo "theol0403/emacs-doom-themes"))

(package! monokai-pro-theme)

(package! evil-textobj-syntax)

(package! beacon :recipe (:host github :repo "Malabarba/beacon"))

(package! good-scroll)
(package! cdlatex)
(package! auctex)
(package! corfu)

#+end_src

#+RESULTS:
| monokai-pro-theme | :modules | ((:private . packages) (:private . modules) (:private . config) (:private . modules)) |


